cmsis-svd/cmsis-svd-data/data/Atmel/ATSAMD20G15.svd
            <register>
               <name>XOSC32K</name>
               <description>32kHz External Crystal Oscillator (XOSC32K) Control</description>
               <addressOffset>0x14</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTALEN</name>
                     <description>Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN32K</name>
                     <description>32kHz Output Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN1K</name>
                     <description>1kHz Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AAMPEN</name>
                     <description>Automatic Amplitude Control Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Oscillator Start-Up Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE1</name>
                           <description>0.122 ms</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32</name>
                           <description>1.068 ms</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE2048</name>
                           <description>62.592 ms</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4096</name>
                           <description>125.092 ms</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE16384</name>
                           <description>500.092 ms</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE32768</name>
                           <description>1000.092 ms</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE65536</name>
                           <description>2000.092 ms</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE131072</name>
                           <description>4000.092 ms</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC32K</name>
               <description>32kHz Internal Oscillator (OSC32K) Control</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x003F0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN32K</name>
                     <description>32kHz Output Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN1K</name>
                     <description>1kHz Output Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STARTUP</name>
                     <description>Oscillator Start-Up Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>STARTUPSelect</name>
                        <enumeratedValue>
                           <name>CYCLE3</name>
                           <description>0.092 ms</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE4</name>
                           <description>0.122 ms</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE6</name>
                           <description>0.183 ms</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE10</name>
                           <description>0.305 ms</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE18</name>
                           <description>0.549 ms</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE34</name>
                           <description>1.038 ms</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE66</name>
                           <description>2.014 ms</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYCLE130</name>
                           <description>3.967 ms</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CALIB</name>
                     <description>Oscillator Calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCULP32K</name>
               <description>OSCULP32K Control</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetValue>0x0F</resetValue>
               <fields>
                  <field>
                     <name>CALIB</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC8M</name>
               <description>8MHz Internal Oscillator (OSC8M) Control</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x87070382</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESC</name>
                     <description>Oscillator Prescaler</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PRESCSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALIB</name>
                     <description>Oscillator Calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>FRANGE</name>
                     <description>Oscillator Frequency Range</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FRANGESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>4 to 6MHz</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>6 to 8MHz</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>8 to 11MHz</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>11 to 15MHz</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLCTRL</name>
               <description>DFLL Config</description>
               <addressOffset>0x24</addressOffset>
               <size>16</size>
               <resetValue>0x0080</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Mode Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STABLE</name>
                     <description>Stable Frequency</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LLAW</name>
                     <description>Lose Lock After Wake</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run during Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>Enable on Demand</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCDIS</name>
                     <description>Chill Cycle Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QLDIS</name>
                     <description>Quick Lock Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLVAL</name>
               <description>DFLL Calibration Value</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FINE</name>
                     <description>Fine Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>COARSE</name>
                     <description>Coarse Calibration Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Multiplication Ratio Difference</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLMUL</name>
               <description>DFLL Multiplier</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MUL</name>
                     <description>Multiplication Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FSTEP</name>
                     <description>Maximum Fine Step Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CSTEP</name>
                     <description>Maximum Coarse Step Size</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFLLSYNC</name>
               <description>DFLL Synchronization</description>
               <addressOffset>0x30</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>READREQ</name>
                     <description>Read Request Synchronization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
